NickWaterton/OpenEPaperLink/ESP32_AP-Flasher/src/wifimanager.cpp
#include "wifimanager.h"

#include <Preferences.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <esp_wifi.h>
#include <esp_idf_version.h>
#ifndef esp_mac_type_t
#include <esp_mac.h>
#endif

#include <ETH.h>
#include <SPI.h> 

#include "newproto.h"
#include "system.h"
#include "tag_db.h"
#include "udp.h"
#include "web.h"
#include "ips_display.h"
#include "tag_db.h"

uint8_t WifiManager::apClients = 0;
uint8_t x_buffer[100];
uint8_t x_position = 0;

#if defined(ETHERNET_PHY_POWER) && defined(ETHERNET_PHY_MDC) && defined(ETHERNET_PHY_MDIO) && defined(ETHERNET_PHY_TYPE) && defined(ETHERNET_CLK_MODE)
static bool eth_init = false;
static bool eth_connected = false;
static bool eth_ip_ok = false;
static long eth_timeout = 0;
#endif
#if defined(HAS_W5500)
static bool eth_init = false;
static bool eth_connected = false;
static bool eth_ip_ok = false;
static long eth_timeout = 0;
#endif

WifiManager::WifiManager() {
    _reconnectIntervalCheck = 5000;
    _retryIntervalCheck = 5 * 60000;
    _connectionTimeout = 15000;

    _nextReconnectCheck = 0;
    _connected = false;
    _savewhensuccessfull = false;
    _ssid = "";
    _APstarted = false;
    wifiStatus = NOINIT;

#if ESP_IDF_VERSION_MAJOR >= 5
    // Arduino 3.x style
    //moved to after WiFi.begin()
#else
    WiFi.onEvent(WiFiEvent);
    WiFiEventId_t eventID = WiFi.onEvent([](WiFiEvent_t event, WiFiEventInfo_t info) {
        Serial.print("WiFi lost connection. Reason: ");
        Serial.println(info.wifi_sta_disconnected.reason);
    }, WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_DISCONNECTED);
#endif
}

void WifiManager::terminalLog(String text) {
    Serial.println(text);
#ifdef HAS_TFT
    TFTLog(text);
#endif
}

void WifiManager::poll() {

#if defined(ETHERNET_PHY_POWER) && defined(ETHERNET_PHY_MDC) && defined(ETHERNET_PHY_MDIO) && defined(ETHERNET_PHY_TYPE) && defined(ETHERNET_CLK_MODE)

    if (eth_connected) {
        wifiStatus = ETHERNET;
        if(!eth_ip_ok && eth_timeout != 0 && millis() - eth_timeout > 2000) {
            eth_timeout = 0;
            eth_connected = false;
        }
    } else if(!eth_connected && wifiStatus == ETHERNET) {
        wifiStatus = NOINIT;
        _APstarted = false;
        WiFi.mode(WIFI_STA);
        connectToWifi();
    }

#endif
#if defined(HAS_W5500)
    static bool wifi_disabled_for_eth = false;
    // Check physical link status
    bool linkStatus = ETH.linkUp();

    if (linkStatus && eth_connected) {
        // Disable WiFi cleanly (once)
        if (!wifi_disabled_for_eth) {
            terminalLog("Ethernet cable connected.");
            wifiStatus = ETHERNET;
            Serial.println("Disabling WiFi due to Ethernet");
            ETH.setHostname(buildHostname(ESP_MAC_ETH).c_str());
            WiFi.disconnect(true);
            vTaskDelay(50 / portTICK_PERIOD_MS); 
            WiFi.mode(WIFI_MODE_NULL);
            init_udp(); // Start your UDP services on the new ETH interface
            wifi_disabled_for_eth = true;
        }
    } else if (!linkStatus && !eth_connected) {
        if (wifi_disabled_for_eth) {
            terminalLog("Ethernet cable disconnected.");
            wifiStatus = NOINIT;
            wifi_disabled_for_eth = false;
            // Re-enable WiFi
            Serial.println("Re-enabling WiFi");
            connectToWifi();
        }
    }
#endif

    if (wifiStatus == AP && millis() > _nextReconnectCheck && _ssid != "") {
        if (apClients == 0) {
            terminalLog("Attempting to reconnect to WiFi.");
            logLine("Attempting to reconnect to WiFi.");
            _APstarted = false;
            wifiStatus = NOINIT;
            connectToWifi();
        } else {
            _nextReconnectCheck = millis() + _retryIntervalCheck;
        }
    }

    if (wifiStatus == CONNECTED && millis() > _nextReconnectCheck) {
        if (WiFi.status() != WL_CONNECTED) {
            _connected = false;
            terminalLog("WiFi connection lost. Attempting to reconnect.");
            logLine("WiFi connection lost. Attempting to reconnect.");
            WiFi.reconnect();
            waitForConnection();
        } else {
            _nextReconnectCheck = millis() + _reconnectIntervalCheck;
        }
    }

#ifndef HAS_USB

#ifdef ETHERNET_CLK_MODE
    if (!(ETHERNET_CLK_MODE == ETH_CLOCK_GPIO0_IN || ETHERNET_CLK_MODE == ETH_CLOCK_GPIO0_OUT)) {
#endif
    // ap_and_flasher has gpio0 in use as FLASHER_AP_POWER
    if (digitalRead(0) == LOW) {
        Serial.println("GPIO0 LOW");
        long starttime = millis();
        while (digitalRead(0) == LOW && millis() - starttime < 5000) {
        }
        if (digitalRead(0) == LOW) {
            Serial.println("Resetting WIFI settings");
            Preferences preferences;
            preferences.begin("wifi", false);
            preferences.putString("ssid", "");
            preferences.putString("pw", "");
            preferences.putString("ip", "");
            preferences.putString("mask", "");
            preferences.putString("gw", "");
            preferences.putString("dns", "");
            preferences.end();

            wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
            esp_wifi_init(&cfg);
            delay(2000);

            if (esp_wifi_restore() != ESP_OK) {
                Serial.println("WiFi is not initialized by esp_wifi_init ");
            } else {
                Serial.println("WiFi Configurations Cleared!");
            }
            delay(100);
            ESP.restart();
        }
    }
#ifdef ETHERNET_CLK_MODE
    }
#endif

#endif

    pollSerial();
}

void WifiManager::initEth() {
#if defined(ETHERNET_PHY_POWER) && defined(ETHERNET_PHY_MDC) && defined(ETHERNET_PHY_MDIO) && defined(ETHERNET_PHY_TYPE) && defined(ETHERNET_CLK_MODE)
    if(!eth_init) {
        eth_init = true;
        ETH.begin(
            ETH_PHY_ADDR,
            ETHERNET_PHY_POWER,
            ETHERNET_PHY_MDC,
            ETHERNET_PHY_MDIO,
            ETHERNET_PHY_TYPE,
            ETHERNET_CLK_MODE,
            false);
    }
#endif
#if defined(HAS_W5500) && ESP_IDF_VERSION_MAJOR >= 5 // W5500 on Arduino 3.x only
    if(!eth_init) {
        eth_init = true;

        // NOTE:
        // W5500 + ETH.h requires Arduino-ESP32 3.x (ESP-IDF 5.x).
        
