NickWaterton/OpenEPaperLink/ESP32_AP-Flasher/src/wifimanager.cpp
        bool success = ETH.begin(
            ETH_PHY_W5500,
            1,                 // phy_addr (ignored for W5500, but required)
            ETH_SPI_CS,
            ETH_PHY_INTR,
            ETH_PHY_RST,
            SPI2_HOST,
            ETH_SPI_SCK,
            ETH_SPI_MISO,
            ETH_SPI_MOSI
        );
        
        if (success) {
            Serial.println("W5500 Ethernet Started");
            logLine("W5500 Ethernet Started");
        } else {
            Serial.println("W5500 Ethernet Failed to Start");
            logLine("W5500 Ethernet Failed to Start");
        }
    }
#elif defined(HAS_W5500)
    // Arduino 2.x fallback
    Serial.println("W5500 Ethernet requires Arduino-ESP32 3.x");
    logLine("W5500 Ethernet requires Arduino-ESP32 3.x");
#endif
}

bool WifiManager::connectToWifi() {
#if defined(ETHERNET_PHY_POWER) && defined(ETHERNET_PHY_MDC) && defined(ETHERNET_PHY_MDIO) && defined(ETHERNET_PHY_TYPE) && defined(ETHERNET_CLK_MODE)
    if (wifiStatus == ETHERNET || eth_connected)
        return true;
#endif
#if defined(HAS_W5500)
    if (wifiStatus == ETHERNET || eth_connected)
        return true;
#endif

    Preferences preferences;
    preferences.begin("wifi", false);
    _ssid = preferences.getString("ssid", WiFi_SSID());
    _pass = preferences.getString("pw", WiFi_psk());
    if (_ssid == "") {
        terminalLog("No connection info saved");
        logLine("No connection information saved");
        startManagementServer();
        return false;
    }
    terminalLog("ssid: " + String(_ssid));

    String ip = preferences.getString("ip", "");
    String mask = preferences.getString("mask", "");
    String gw = preferences.getString("gw", "");
    String dns = preferences.getString("dns", "");

    if (ip.length() > 0) {
        IPAddress staticIP, subnetMask, gatewayIP, dnsIP;
        if (staticIP.fromString(ip) && subnetMask.fromString(mask) && gatewayIP.fromString(gw)) {
            if (dns.length() > 0) dnsIP.fromString(dns);
            WiFi.config(staticIP, gatewayIP, subnetMask, dnsIP);
            terminalLog("Setting static IP: " + ip);
        }
    }

    _connected = connectToWifi(_ssid, _pass, false);
    return _connected;
}

bool WifiManager::connectToWifi(String ssid, String pass, bool savewhensuccessfull) {
#if defined(ETHERNET_PHY_POWER) && defined(ETHERNET_PHY_MDC) && defined(ETHERNET_PHY_MDIO) && defined(ETHERNET_PHY_TYPE) && defined(ETHERNET_CLK_MODE)
    if (wifiStatus == ETHERNET)
        return true;
#endif
#if defined(HAS_W5500)
    if (wifiStatus == ETHERNET)
        return true;
#endif

    _ssid = ssid;
    _pass = pass;
    _savewhensuccessfull = savewhensuccessfull;

    _APstarted = false;
    WiFi.disconnect(true, true);
    vTaskDelay(100 / portTICK_PERIOD_MS);
    WiFi.mode(WIFI_MODE_NULL);
    vTaskDelay(100 / portTICK_PERIOD_MS);
    WiFi.setHostname(buildHostname(ESP_MAC_WIFI_STA).c_str());
    WiFi.mode(WIFI_STA);
    WiFi.setSleep(WIFI_PS_MIN_MODEM);
    WiFi.persistent(savewhensuccessfull);
    terminalLog("Connecting to WiFi...");
    // logLine("Connecting to WiFi...");
    WiFi.begin(_ssid.c_str(), _pass.c_str());
#if ESP_IDF_VERSION_MAJOR >= 5
    // Arduino 3.x style
    static bool first_connect_to_wifi = true;
    if (first_connect_to_wifi) {
        WiFi.onEvent([this](WiFiEvent_t event, WiFiEventInfo_t info){
            this->WiFiEvent(event, info);
        });
        WiFiEventId_t eventID = WiFi.onEvent([](WiFiEvent_t event, WiFiEventInfo_t info) {
            Serial.print("WiFi lost connection. Reason: ");
            Serial.println(info.wifi_sta_disconnected.reason);
        }, WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_DISCONNECTED);
        first_connect_to_wifi = false;
    }
#endif
    _connected = waitForConnection();
    return _connected;
}

bool WifiManager::waitForConnection() {
#if defined(ETHERNET_PHY_POWER) && defined(ETHERNET_PHY_MDC) && defined(ETHERNET_PHY_MDIO) && defined(ETHERNET_PHY_TYPE) && defined(ETHERNET_CLK_MODE)
    if (wifiStatus == ETHERNET)
        return true;
#endif
#if defined(HAS_W5500)
    if (wifiStatus == ETHERNET)
        return true;
#endif

    unsigned long timeout = millis() + _connectionTimeout;
    wifiStatus = WAIT_CONNECTING;

    while (WiFi.status() != WL_CONNECTED) {
        if (millis() > timeout) {
            terminalLog("!Unable to connect to WiFi");
            logLine("Unable to connect to WiFi");
            startManagementServer();
            return false;
        }
        vTaskDelay(250 / portTICK_PERIOD_MS);
    }

    if (_savewhensuccessfull) {
        Preferences preferences;
        preferences.begin("wifi", false);
        preferences.putString("ssid", _ssid);
        preferences.putString("pass", _pass);
        preferences.end();
        _savewhensuccessfull = false;
    }
    WiFi.setAutoReconnect(true);
    WiFi.persistent(true);
    IPAddress IP = WiFi.localIP();
    terminalLog("Connected!");
    // logLine("Connected!");
    _nextReconnectCheck = millis() + _reconnectIntervalCheck;
    wifiStatus = CONNECTED;
    return true;
}

void WifiManager::startManagementServer() {
    if (!_APstarted && wifiStatus != ETHERNET) {
        terminalLog("Starting config AP, ssid: OpenEPaperLink");
        logLine("Starting configuration AP, ssid OpenEPaperLink");
        WiFi.disconnect(true, true);
        delay(100);
        WiFi.mode(WIFI_AP);
        WiFi.softAP("OpenEPaperLink", "", 1, false);
        WiFi.softAPsetHostname("OpenEPaperLink");
        IPAddress IP = WiFi.softAPIP();
        terminalLog("Connect to it, visit http://" + String(IP.toString().c_str()) + "/setup");
        _APstarted = true;
        _nextReconnectCheck = millis() + _retryIntervalCheck;
        wifiStatus = AP;
    }
}

String WifiManager::buildHostname(esp_mac_type_t mac_type) {
    char hostname[32] = "OpenEpaperLink-";
    uint8_t mac[6];
    esp_read_mac(mac, mac_type);
    char lastTwoBytes[5];
    sprintf(lastTwoBytes, "%02X%02X", mac[4], mac[5]);
    strcat(hostname, lastTwoBytes);

    if (config.alias[0] != '\0') {
        int len = strlen(config.alias);
        int j = 0;
        for (int i = 0; i < len; i++) {
            char c = config.alias[i];
            if ((c >= 'A' && c <= 'Z') || (c >= 'a' && c <= 'z') || (c >= '0' && c <= '9') || c == '-') {
                hostname[j] = c;
                j++;
            }
        }
        hostname[j] = '\0';
    }
    return String(hostname);
}

IPAddress WifiManager::localIP() {
    if (wifiStatus == ETHERNET) {
        return ETH.localIP();
    } else {
        return WiFi.localIP();
    }
}

String WifiManager::WiFi_SSID() {
    wifi_config_t conf;
    esp_wifi_get_config(WIFI_IF_STA, &conf);
    return String(reinterpret_cast<const char *>(conf.sta.ssid));
}

String WifiManager::WiFi_psk() {
    if (WiFiGenericClass::getMode() == WIFI_MODE_NULL) {
        return String();
    }
    wifi_config_t conf;
    esp_wifi_get_config(WIFI_IF_STA, &conf);
    return String(reinterpret_cast<char *>(conf.sta.password));
}

void WifiManager::pollSerial() {
    while (Serial.available() > 0) {
        char receivedChar = Serial.read();

        if (parse_improv_serial_byte(x_position, receivedChar, x_buffer, onCommandCallback, onErrorCallback)) {
            x_buffer[x_position++] = receivedChar;
            if (x_position > 100) {
                x_position = 0;
                Serial.println("buffer full!");
            }
        } else {
            x_position = 0;
        }
    }
}

