NickWaterton/OpenEPaperLink/ESP32_AP-Flasher/src/wifimanager.cpp
#if ESP_IDF_VERSION_MAJOR >= 5
void WifiManager::WiFiEvent(WiFiEvent_t event, WiFiEventInfo_t info) {
#else
void WifiManager::WiFiEvent(WiFiEvent_t event) {
#endif
    // Do NOT modify WiFi state in this callback - it will cause memory errors and reboots. Set a flag and make the change in poll instead
    Serial.printf("[WiFi-event %d] ", event);
    String eventname="";

    switch (event) {
        case ARDUINO_EVENT_WIFI_STA_CONNECTED:
            eventname = "Connected to access point";
            break;
        case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
            // eventname = "Disconnected from WiFi access point";
            break;
        case ARDUINO_EVENT_WIFI_STA_AUTHMODE_CHANGE:
            eventname = "Authentication mode of access point has changed";
            break;
        case ARDUINO_EVENT_WIFI_STA_GOT_IP:
            eventname = "Obtained IP address: " + String(WiFi.localIP().toString().c_str());
            init_udp();
            break;
        case ARDUINO_EVENT_WIFI_STA_LOST_IP:
            eventname = "Lost IP address and IP address is reset to 0";
            break;

        case ARDUINO_EVENT_WIFI_AP_START:
            // eventname = "WiFi access point started";
            break;
        case ARDUINO_EVENT_WIFI_AP_STOP:
            // eventname = "WiFi access point stopped";
            break;
        case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
            apClients++;
            // eventname = "Client connected";
            break;
        case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
            apClients--;
            // eventname = "Client disconnected";
            break;
        case ARDUINO_EVENT_WIFI_AP_STAIPASSIGNED:
            // eventname = "Assigned IP address to client";
            break;

#if defined(ETHERNET_PHY_POWER) && defined(ETHERNET_PHY_MDC) && defined(ETHERNET_PHY_MDIO) && defined(ETHERNET_PHY_TYPE) && defined(ETHERNET_CLK_MODE)

        case ARDUINO_EVENT_ETH_START:
            eventname = "ETH Started";
            //set eth hostname here
            ETH.setHostname(buildHostname(ESP_MAC_ETH).c_str());
            eth_timeout = 0;
            break;
        case ARDUINO_EVENT_ETH_CONNECTED:
            eventname = "ETH Connected";
            WiFi.mode(WIFI_MODE_NULL);
            WiFi.disconnect();
            eth_connected = true;
            eth_timeout = millis();
            break;
        case ARDUINO_EVENT_ETH_GOT_IP:
            if (ETH.fullDuplex()) {
                eventname = "ETH MAC: " + ETH.macAddress() + ", IPv4: " + ETH.localIP().toString() + ", FULL_DUPLEX, " + ETH.linkSpeed() + "Mbps";
            } else {
                eventname = "ETH MAC: " + ETH.macAddress() + ", IPv4: " + ETH.localIP().toString() + ", " + ETH.linkSpeed() + "Mbps";
            }
            eth_ip_ok = true;
            init_udp();
            eth_timeout = 0;
            break;
        case ARDUINO_EVENT_ETH_DISCONNECTED:
            eventname = "ETH Disconnected";
            eth_connected = false;
            eth_ip_ok = false;
            eth_timeout = 0;
            break;
        case ARDUINO_EVENT_ETH_STOP:
            eventname = "ETH Stopped";
            eth_connected = false;
            eth_ip_ok = false;
            eth_timeout = 0;
            break;

#endif
#if defined(HAS_W5500)

        case ARDUINO_EVENT_ETH_START:
            eventname = "ETH (W5500) Started";
            eth_timeout = 0;
            break;
        case ARDUINO_EVENT_ETH_CONNECTED:
            eventname = "ETH Connected";
            eth_timeout = millis();
            break;
        case ARDUINO_EVENT_ETH_GOT_IP:
            // W5500 is typically 10/100Mbps
             if (ETH.fullDuplex()) {
                eventname = "ETH MAC: " + ETH.macAddress() + ", IPv4: " + ETH.localIP().toString() + ", FULL_DUPLEX, " + ETH.linkSpeed() + "Mbps";
            } else {
                eventname = "ETH MAC: " + ETH.macAddress() + ", IPv4: " + ETH.localIP().toString() + ", " + ETH.linkSpeed() + "Mbps";
            }
            eth_ip_ok = true;
            eth_connected = true;
            eth_timeout = 0;
            break;
        case ARDUINO_EVENT_ETH_DISCONNECTED:
            eventname = "ETH Disconnected";
            eth_connected = false;
            eth_ip_ok = false;
            eth_timeout = 0;
            break;
        case ARDUINO_EVENT_ETH_STOP:
            eventname = "ETH Stopped";
            eth_connected = false;
            eth_ip_ok = false;
            eth_timeout = 0;
            break;

#endif

        default:
            break;
    }
    if (eventname) terminalLog(eventname);
    //if (eventname) logLine("WiFi event [" + String(event) + "]: " + eventname);
}

// *** Improv
// https :  // github.com/jnthas/improv-wifi-demo

#define STR_IMPL(x) #x
#define _STR(x) STR_IMPL(x)

#ifndef BUILD_ENV_NAME
#define BUILD_ENV_NAME unknown
#endif
#ifndef BUILD_TIME
#define BUILD_TIME 0
#endif
#ifndef BUILD_VERSION
#define BUILD_VERSION custom
#endif

std::vector<std::string> getLocalUrl() {
    return {String("http://" + WiFi.localIP().toString()).c_str()};
}

String getActiveMacAddress() {
#if defined(HAS_W5500)
    if (eth_connected) {
        uint8_t mac[6];
        esp_read_mac(mac, ESP_MAC_ETH);
        char buf[25];
        sprintf(buf, "(ETH) %02X:%02X:%02X:%02X:%02X:%02X",
                mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
        return String(buf);
    }
#endif
    // Fallback to WiFi STA MAC
    return WiFi.macAddress();
}

void onErrorCallback(improv::Error err) {
}

bool onCommandCallback(improv::ImprovCommand cmd) {
    switch (cmd.command) {
        case improv::Command::GET_CURRENT_STATE: {
            if ((WiFi.status() == WL_CONNECTED)) {
                set_state(improv::State::STATE_PROVISIONED);
                std::vector<uint8_t> data = improv::build_rpc_response(improv::GET_CURRENT_STATE, getLocalUrl(), false);
                send_response(data);
            } else {
                set_state(improv::State::STATE_AUTHORIZED);
            }
            break;
        }

